# RbsLiningThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsLiningThickness Property
ParameterTypeId Class See Also
---
"Lining Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsLiningThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsLiningThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsLiningThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace